Revit 2027 API
MEPNetworkSegmentData.Velocity Property
 The calculated velocity of this segment, in ft/s.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Velocity { get; }
Public ReadOnly Property Velocity As Double
	Get
public:
property double Velocity {
	double get ();
}
member Velocity : float with get
Property Value
Double
See Also
Reference
MEPNetworkSegmentData Class
Autodesk.Revit.DB.Analysis Namespace